package lesson3;

public class FirstProgram {
    /* 1. Вычисление корней квадратного уравнения
    Условие: Метод принимает в качестве аргументов коэффициенты a, b, c квадратного уравнения (a*x^+b*x+c=0).
    В теле метода требуется вывести на экран значения корней этого уравнения согласно следующим правилам:
    если первый коэффициент a равен нулю, то вывести "Первый коэффициент не может быть 0";
    если уравнение не имеет корней, то вывести "Нет действительных решений уравнения";
    если уравнение имеет два корня, то вывести их в строку через пробел (для одного корня, достаточно одного значения).
     */
    /* Для начала находится дискриминант по формуле D = b2 - 4ac:
    -Если D > 0, уравнение имеет два корня: x1 = (- b + √D)/2a x2 = (- b - √D)/2a
    -Если D = 0, уравнение имеет один корень. x = - b / 2 a
    -Если D < 0, уравнение не имеет корней.
     */
    public static void main(String[] args){

    }
    public static long diskriminant(long b, long a, long c){

    }

}
